Catalogs/КлючиВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлючиВидовПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииГИСМТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииСАТУРН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииЗЕРНО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлючиВидовПродукцииИС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроверитьНаДубли(Отказ);
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаДубли(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",             Ссылка);
	Запрос.УстановитьПараметр("ВидПродукцииГИСМТ",  ВидПродукцииГИСМТ);
	Запрос.УстановитьПараметр("ВидПродукцииЕГАИС",  ВидПродукцииЕГАИС);
	Запрос.УстановитьПараметр("ВидПродукцииВЕТИС",  ВидПродукцииВЕТИС);
	Запрос.УстановитьПараметр("ВидПродукцииСАТУРН", ВидПродукцииСАТУРН);
	Запрос.УстановитьПараметр("ВидПродукцииЗЕРНО",  ВидПродукцииЗЕРНО);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлючиВидовПродукцииИС.Ссылка
	|ИЗ
	|	Справочник.КлючиВидовПродукцииИС КАК КлючиВидовПродукцииИС
	|ГДЕ
	|	КлючиВидовПродукцииИС.Ссылка <> &Ссылка
	|	И КлючиВидовПродукцииИС.ВидПродукцииГИСМТ = &ВидПродукцииГИСМТ
	|	И КлючиВидовПродукцииИС.ВидПродукцииЕГАИС = &ВидПродукцииЕГАИС
	|	И КлючиВидовПродукцииИС.ВидПродукцииВЕТИС = &ВидПродукцииВЕТИС
	|	И КлючиВидовПродукцииИС.ВидПродукцииСАТУРН = &ВидПродукцииСАТУРН
	|	И КлючиВидовПродукцииИС.ВидПродукцииЗЕРНО = &ВидПродукцииЗЕРНО";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Ключ <%1> уже присутствует. Дублирование ключа запрещено.'"),
			Выборка.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
